hotdb_scripts/10B_LuMDB_YCSB_performance/LuMDB_10B_val_128_memMiB_zipf1.2_iteratoration20.log
../../hotdb/release/db_bench --db=/mnt/hotdb_test/hotdb10B/ycsba_hot__P__1.2_iterator20 --num=1000000000 --value_size=128 --batch_size=1000 --benchmarks=fillzipf,stats --data_file=/home/jeff-wang/workloads/zipf1.2_keys10.0B.csv --logpath=/mnt/logs --bloom_bits=10 --log=1 --Read_data_file= --cache_size=8388608 --open_files=40000 --use_existing_db=false --reads=1000 --compression=0 --stats_interval=100000000 --histogram=1 --print_wa=true 
Keys:       16 bytes each
Values:     128 bytes each (64 bytes after compression)
Entries:    1000000000
RawSize:    137329.1 MB (estimated)
FileSize:   76293.9 MB (estimated)
WARNING: Optimization is disabled: benchmarks unnecessarily slow
WARNING: Assertions are enabled; benchmarks unnecessarily slow
WARNING: Snappy compression is not enabled
some command parameters have been selected:
  threads: 1
  duration: 0
  print_wa: 1
  num_entries: 1000000000
  bechmark selected fillzipf,stats
  hot_file_path: 
  data_file_path: /home/jeff-wang/workloads/zipf1.2_keys10.0B.csv
  percentages: 
  write_buffer_size: 1048576
  Hot data definition: 2
  Print Interval: 100000000
------------------------------------------------
we have 1 runs in level 0
we have 4 runs in level 1
we have 4 runs in level 2
we have 4 runs in level 3
we have 4 runs in level 4
we have 4 runs in level 5
we have 4 runs in level 6
After restoring, we have 0 leveling files and 0 Tiering file!
We have created a new mainfest file!
There 0 ranges was released in hot ranges!
we have 1 runs in level 0
we have 4 runs in level 1
we have 4 runs in level 2
we have 4 runs in level 3
we have 4 runs in level 4
we have 4 runs in level 5
we have 4 runs in level 6
After restoring, we have 0 leveling files and 0 Tiering file!
We have created a new mainfest file!
delete partition 3
delete partition 41
2024-11-23 21:15:00 ... thread 0: (100000000,100000000) ops and (67763.2,67763.2) ops/second in (1475.726715,1475.726715) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0    13(  44)       0     405       0       0     2000    11782      0      84(    202)  2482(   9696)     0(      0)       0(      0)      0(      0)      0(      0)   286         0        0        0
    1    75(   8)       0     449    1996   12521     1542      803      0     740(      0)  2960(      0)     0(    396)       0(      0)      0(      0)      0(      0)   740         0        0        0
    2   430(   0)       0     264   10376       0     9717        0      0       0(      0)     0(      0)  4694(      0)       0(      0)      0(      0)      0(      0)     0         0        0        0
user_io:13781.961MB total_ios: 25844.239MB WriteAmplification: 1.8752
100000000 operations have been finished (user has been written 0.000 MB data into db.)


2024-11-23 21:44:46 ... thread 0: (100000000,200000000) ops and (55980.5,61310.9) ops/second in (1786.337786,3262.064501) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0    21(  11)       0     776       0       0     3689    23877      0     167(    411)  4474(  19728)     0(      0)       0(      0)      0(      0)      0(      0)   578         0        0        0
    1    38(   8)       0     850    3681   25499     3084     1647      0    1517(      0)  6068(      0)     0(    814)       0(      0)      0(      0)      0(      0)  1517         0        0        0
    2   771(   0)       0     915   36708       0    35175        0      0       0(      0)     0(      0) 17217(      0)       0(      0)      0(      0)      0(      0)     0         0        0        0
user_io:27566.280MB total_ios: 67473.006MB WriteAmplification: 2.4477
200000000 operations have been finished (user has been written 13733.014 MB data into db.)


2024-11-23 22:15:41 ... thread 0: (100000000,300000000) ops and (53905.2,58626.1) ops/second in (1855.109368,5117.173869) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0    31(  26)       0    1108       0       0     5378    35974      0     250(    619)  6466(  29712)     0(      0)       0(      0)      0(      0)      0(      0)   869         0        0        0
    1     1(   8)       0    1248    5365   38416     4626     2487      0    2294(      0)  9176(      0)     0(   1230)       0(      0)      0(      0)      0(      0)  2294         0        0        0
    2   973(   0)       0    1707   75943       0    73479        0      0      91(      0)    91(      0) 36073(      0)       0(      0)      0(      0)      0(      0)    91        13        0        2
    3   104(   0)       0      19     958       0      958        0      0       0(      0)     0(      0)   383(      0)       0(      0)      0(      0)      0(      0)     0         0        2        0
user_io:41351.147MB total_ios: 122900.858MB WriteAmplification: 2.9721
300000000 operations have been finished (user has been written 27466.030 MB data into db.)


2024-11-23 22:52:55 ... thread 0: (100000000,400000000) ops and (44761.3,54412.5) ops/second in (2234.073957,7351.247826) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0    42(  42)       0    1447       0       0     7067    48069      0     333(    827)  8458(  39696)     0(      0)       0(      0)      0(      0)      0(      0)  1160         0        0        0
    1   108(   8)       0    1635    7048   51334     6168     3326      0    3035(      0) 12140(      0)     0(   1646)       0(      0)      0(      0)      0(      0)  3035         0        0        0
    2  1003(   0)       0    2640  117039       0   113664        0      0     343(      0)   343(      0) 55867(      0)       0(      0)      0(      0)      0(      0)   343        16        0        2
    3   359(   0)       0     230    9500       0     9490        0      0       0(      0)     0(      0)  4347(      0)       0(      0)      0(      0)      0(      0)     0         0        2        0
user_io:55135.973MB total_ios: 187784.268MB WriteAmplification: 3.4058
400000000 operations have been finished (user has been written 41199.045 MB data into db.)


2024-11-23 23:42:47 ... thread 0: (100000000,500000000) ops and (33422.6,48340.8) ops/second in (2991.986507,10343.234333) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0    31(   9)       0    1892       0       0     8756    60164      0     417(   1036) 10474(  49728)     0(      0)       0(      0)      0(      0)      0(      0)  1453         0        0        0
    1   108(   8)       0    2071    8752   64312     7728     4170      0    3812(      0) 15248(      0)     0(   2064)       0(      0)      0(      0)      0(      0)  3812         0        0        0
    2  1016(   0)       0    3765  160944       0   156606        0      0     620(      0)   620(      0) 77026(      0)       0(      0)      0(      0)      0(      0)   620        16        0        2
    3   624(   0)       0     724   28155       0    28120        0      0       0(      0)     0(      0) 13296(      0)       0(      0)      0(      0)      0(      0)     0         0        2        0
user_io:68920.000MB total_ios: 265543.468MB WriteAmplification: 3.8529
500000000 operations have been finished (user has been written 54932.060 MB data into db.)


2024-11-24 00:33:44 ... thread 0: (100000000,600000000) ops and (32716.3,44776.7) ops/second in (3056.577019,13399.811352) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0    41(  23)       0    2285       0       0    10444    72259      0     500(   1244) 12466(  59712)     0(      0)       0(      0)      0(      0)      0(      0)  1744         0        0        0
    1    75(   8)       0    2502   10435   77230     9269     5009      0    4588(      0) 18352(      0)     0(   2480)       0(      0)      0(      0)      0(      0)  4588         0        0        0
    2  1024(   0)       0    4958  205287       0   199982        0      0     904(      0)   904(      0) 98391(      0)       0(      0)      0(      0)      0(      0)   904        16        0        2
    3   890(   0)       0    1323   54142       0    54066        0      0       0(      0)     0(      0) 25864(      0)       0(      0)      0(      0)      0(      0)     0         0        2        0
user_io:82703.245MB total_ios: 351029.166MB WriteAmplification: 4.2444
600000000 operations have been finished (user has been written 68665.075 MB data into db.)


2024-11-24 01:30:08 ... thread 0: (100000000,700000000) ops and (29554.8,41708.0) ops/second in (3383.543893,16783.355245) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0    54(  38)       0    2753       0       0    12133    84356      0     583(   1452) 14458(  69696)     0(      0)       0(      0)      0(      0)      0(      0)  2035         0        0        0
    1    38(   8)       0    2961   12117   90147    10810     5849      0    5365(      0) 21460(      0)     0(   2896)       0(      0)      0(      0)      0(      0)  5365         0        0        0
    2  1032(   0)       0    6249  250050       0   243776        0      0    1185(      0)  1185(      0) 119970(      0)       0(      0)      0(      0)      0(      0)  1185        17        0        2
    3  1149(   0)       0    2003   81554       0    81428        0      0       0(      0)     0(      0) 39154(      0)       0(      0)      0(      0)      0(      0)     0         0        2        0
user_io:96489.120MB total_ios: 438352.446MB WriteAmplification: 4.5430
700000000 operations have been finished (user has been written 82398.090 MB data into db.)


delete partition 42
delete partition 43
2024-11-24 02:18:38 ... thread 0: (100000000,800000000) ops and (34359.5,40622.0) ops/second in (2910.403491,19693.758736) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0    23(   6)       0    3076       0       0    13822    96451      0     667(   1661) 16487(  79728)     0(      0)       0(      0)      0(      0)      0(      0)  2328         0        0        0
    1     1(   8)       0    3372   13802  103126    12353     6693      0    6142(      0) 24568(      0)     0(   3314)       0(      0)      0(      0)      0(      0)  6142         1        0        0
    2  1039(   0)       0    7332  295103       0   287858        0      0    1467(      0)  1467(      0) 141678(      0)       0(      0)      0(      0)      0(      0)  1467        17        0        2
    3  1403(   0)       0    2740  115501       0   115318        0      0       0(      0)     0(      0) 55660(      0)       0(      0)      0(      0)      0(      0)     0         0        2        0
user_io:110273.280MB total_ios: 532494.194MB WriteAmplification: 4.8289
800000000 operations have been finished (user has been written 96131.105 MB data into db.)


2024-11-24 03:09:14 ... thread 0: (100000000,900000000) ops and (32937.0,39595.5) ops/second in (3036.103042,22729.861778) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0     4(  20)       0    3442       0       0    15511   108547      0     751(   1869) 18503(  89712)     0(      0)       0(      0)      0(      0)      0(      0)  2620         0        0        0
    1     1(   8)       0    3790   15507  116042    13914     7532      0    6919(      0) 27676(      0)     0(   3730)       0(      0)      0(      0)      0(      0)  6919         1        0        0
    2  1043(   0)       0    8307  340403       0   332188        0      0    1752(      0)  1752(      0) 163504(      0)       0(      0)      0(      0)      0(      0)  1752        18        0        2
    3  1659(   0)       0    3587  157872       0   157626        0      0       0(      0)     0(      0) 76313(      0)       0(      0)      0(      0)      0(      0)     0         0        2        0
user_io:124057.432MB total_ios: 635317.506MB WriteAmplification: 5.1212
900000000 operations have been finished (user has been written 109864.120 MB data into db.)


2024-11-24 03:59:27 ... thread 0: (100000000,1000000000) ops and (33194.0,38846.3) ops/second in (3012.590039,25742.451817) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0     9(  36)       0    3741       0       0    17199   120642      0     834(   2077) 20495(  99696)     0(      0)       0(      0)      0(      0)      0(      0)  2911         0        0        0
    1   108(   8)       0    4194   17192  128959    15456     8372      0    7660(      0) 30640(      0)     0(   4146)       0(      0)      0(      0)      0(      0)  7660         1        0        0
    2  1043(   0)       0    9215  383714       0   374574        0      0    2028(      0)  2028(      0) 184386(      0)       0(      0)      0(      0)      0(      0)  2028        18        0        2
    3  1899(   0)       0    4648  205604       0   205291        0      0       0(      0)     0(      0) 99554(      0)       0(      0)      0(      0)      0(      0)     0         0        2        0
user_io:137841.595MB total_ios: 741535.445MB WriteAmplification: 5.3796
1000000000 operations have been finished (user has been written 123597.135 MB data into db.)


1000000000 operations have been finished (137330.149 MB data have been written into db)
fillzipf     :      25.742 micros/op 38846 ops/sec;    5.3 MB/s
Microseconds per op:
Count: 1000000000  Average: 25.7425  StdDev: 27752.86
Percentiles: P50: 1.08 P75: 1.55 P99: 2.00 P99.9: 4.41 P99.99: 14800.00
------------------------------------------------------
[       0,       1 ) 458083907  45.808%  45.808% #########
[       1,       2 ) 532491270  53.249%  99.058% ###########
[       2,       3 ) 7873348   0.787%  99.845% 
[       3,       4 )  380961   0.038%  99.883% 
[       4,       5 )  416751   0.042%  99.925% 
[       5,       6 )  281450   0.028%  99.953% 
[       6,       7 )   92322   0.009%  99.962% 
[       7,       8 )   38210   0.004%  99.966% 
[       8,       9 )   16835   0.002%  99.968% 
[       9,      10 )    7342   0.001%  99.968% 
[      10,      12 )   45942   0.005%  99.973% 
[      12,      14 )   18259   0.002%  99.975% 
[      14,      16 )    7829   0.001%  99.975% 
[      16,      18 )   49561   0.005%  99.980% 
[      18,      20 )   20627   0.002%  99.982% 
[      20,      25 )    2494   0.000%  99.983% 
[      25,      30 )     678   0.000%  99.983% 
[      30,      35 )     375   0.000%  99.983% 
[      35,      40 )     564   0.000%  99.983% 
[      40,      45 )     526   0.000%  99.983% 
[      45,      50 )     549   0.000%  99.983% 
[      50,      60 )     924   0.000%  99.983% 
[      60,      70 )    1441   0.000%  99.983% 
[      70,      80 )    6535   0.001%  99.984% 
[      80,      90 )    2551   0.000%  99.984% 
[      90,     100 )    1396   0.000%  99.984% 
[     100,     120 )    3602   0.000%  99.985% 
[     120,     140 )    2501   0.000%  99.985% 
[     140,     160 )    3765   0.000%  99.985% 
[     160,     180 )    2853   0.000%  99.986% 
[     180,     200 )    3960   0.000%  99.986% 
[     200,     250 )   10807   0.001%  99.987% 
[     250,     300 )    4104   0.000%  99.987% 
[     300,     350 )    2469   0.000%  99.988% 
[     350,     400 )    1253   0.000%  99.988% 
[     400,     450 )     713   0.000%  99.988% 
[     450,     500 )     466   0.000%  99.988% 
[     500,     600 )     915   0.000%  99.988% 
[     600,     700 )     607   0.000%  99.988% 
[     700,     800 )     424   0.000%  99.988% 
[     800,     900 )     382   0.000%  99.988% 
[     900,    1000 )     372   0.000%  99.988% 
[    1000,    1200 )     616   0.000%  99.988% 
[    1200,    1400 )     785   0.000%  99.988% 
[    1400,    1600 )     781   0.000%  99.988% 
[    1600,    1800 )     757   0.000%  99.988% 
[    1800,    2000 )     736   0.000%  99.989% 
[    2000,    2500 )    2098   0.000%  99.989% 
[    2500,    3000 )    1999   0.000%  99.989% 
[    3000,    3500 )    1697   0.000%  99.989% 
[    3500,    4000 )    2332   0.000%  99.989% 
[    4000,    4500 )    2111   0.000%  99.990% 
[    4500,    5000 )    1387   0.000%  99.990% 
[    5000,    6000 )    1529   0.000%  99.990% 
[    6000,    7000 )     854   0.000%  99.990% 
[    7000,    8000 )     308   0.000%  99.990% 
[    8000,    9000 )      99   0.000%  99.990% 
[    9000,   10000 )      42   0.000%  99.990% 
[   10000,   12000 )      17   0.000%  99.990% 
[   12000,   14000 )      10   0.000%  99.990% 
[   14000,   16000 )       5   0.000%  99.990% 
[   20000,   25000 )   29596   0.003%  99.993% 
[   25000,   30000 )   32048   0.003%  99.996% 
[   30000,   35000 )    4111   0.000%  99.997% 
[   35000,   40000 )    3628   0.000%  99.997% 
[   40000,   45000 )    3103   0.000%  99.997% 
[   45000,   50000 )    4223   0.000%  99.998% 
[   50000,   60000 )    5077   0.001%  99.998% 
[   60000,   70000 )    1474   0.000%  99.998% 
[   70000,   80000 )     740   0.000%  99.998% 
[   80000,   90000 )     401   0.000%  99.998% 
[   90000,  100000 )     229   0.000%  99.998% 
[  100000,  120000 )     302   0.000%  99.998% 
[  120000,  140000 )     307   0.000%  99.999% 
[  140000,  160000 )    1197   0.000%  99.999% 
[  160000,  180000 )     511   0.000%  99.999% 
[  180000,  200000 )     360   0.000%  99.999% 
[  200000,  250000 )    3246   0.000%  99.999% 
[  250000,  300000 )    2103   0.000%  99.999% 
[  300000,  350000 )     968   0.000%  99.999% 
[  350000,  400000 )     925   0.000%  99.999% 
[  400000,  450000 )     462   0.000% 100.000% 
[  450000,  500000 )     354   0.000% 100.000% 
[  500000,  600000 )     806   0.000% 100.000% 
[  600000,  700000 )     750   0.000% 100.000% 
[  700000,  800000 )     180   0.000% 100.000% 
[  800000,  900000 )      70   0.000% 100.000% 
[  900000, 1000000 )      51   0.000% 100.000% 
[ 1000000, 1200000 )      64   0.000% 100.000% 
[ 1200000, 1400000 )      41   0.000% 100.000% 
[ 1400000, 1600000 )    1128   0.000% 100.000% 
[ 1600000, 1800000 )     470   0.000% 100.000% 
[ 1800000, 2000000 )     287   0.000% 100.000% 
[ 2000000, 2500000 )     284   0.000% 100.000% 
[ 2500000, 3000000 )      46   0.000% 100.000% 
[ 3000000, 3500000 )      35   0.000% 100.000% 
[ 3500000, 4000000 )      14   0.000% 100.000% 
[ 4000000, 4500000 )      15   0.000% 100.000% 
[ 4500000, 5000000 )      12   0.000% 100.000% 
[ 5000000, 6000000 )      21   0.000% 100.000% 
[ 6000000, 7000000 )      10   0.000% 100.000% 
[ 7000000, 8000000 )       5   0.000% 100.000% 
[ 8000000, 9000000 )       5   0.000% 100.000% 
[ 9000000, 10000000 )       4   0.000% 100.000% 
[ 10000000, 12000000 )       9   0.000% 100.000% 
[ 12000000, 14000000 )       9   0.000% 100.000% 
[ 14000000, 16000000 )       4   0.000% 100.000% 
[ 16000000, 18000000 )       9   0.000% 100.000% 
[ 18000000, 20000000 )       5   0.000% 100.000% 
[ 20000000, 25000000 )      27   0.000% 100.000% 
[ 25000000, 30000000 )      26   0.000% 100.000% 
[ 30000000, 35000000 )      43   0.000% 100.000% 
[ 35000000, 40000000 )      53   0.000% 100.000% 
[ 40000000, 45000000 )      49   0.000% 100.000% 
[ 45000000, 50000000 )      29   0.000% 100.000% 
[ 50000000, 60000000 )      23   0.000% 100.000% 
[ 60000000, 70000000 )      14   0.000% 100.000% 
[ 70000000, 80000000 )       6   0.000% 100.000% 
[ 80000000, 90000000 )      10   0.000% 100.000% 
[ 90000000, 100000000 )      12   0.000% 100.000% 
[ 100000000, 120000000 )       5   0.000% 100.000% 
[ 200000000, 250000000 )       1   0.000% 100.000% 


                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0       45        0      3741        0    137842
  1      116        0      4194   146151     23828
  2     1043        0      9215   383714    374574
  3     1899        0      4648   205604    205291
user_io:137841.595MB total_ios: 741535.445MB WriteAmplification: 5.3796

There 0 ranges was released in hot ranges!